{
  "greeting": "Hello 👋🏼, I am ",
  "occupation": "Software Developer",
  "h2.1": "About me",
  "h2.2": "Experience",
  "h2.3": "Projects",
  "h2.4": "Contact me",
  "aboutMe": "My connection with technology began at the age of 7 with a Family Game, prompting me to ask for a computer instead of going on a graduation trip. I entered the tech world through the industrial sector, learning algorithms, C++, and PLC as I pursued my education. Since then, my focus has revolved around coding. As a junior full stack developer, I merge creativity with technical skills to approach projects from diverse perspectives, aiming to create functional solutions and meaningful user experiences. My journey in technology continues to evolve, and I'm excited about the opportunities for ongoing growth.",
  "education": "Education",
  "education.ctd.0": "ongoing",
  "education.ctd.1": "Degree created by",
  "education.ctd.2": "through",
  "education.ctd.3": ", to shape highly versatile developer profiles, covering",
  "education.ctd.4": "Infrastructure",
  "education.ctd.5": ", as well as addressing soft skills through workshops on",
  "education.ctd.6": "Effective Communication, Teamwork, and Collaboration",
  "education.ctd.7": ", along with group work and integrative projects, among others. This is why I considered this to be the best path for me to become a Software Developer.",
  "education.ctd.8": "1 year completed - Certified as",
  "education.ctd.8.1": "Professional Developer.",
  "education.ctd.9": "2nd year - Pursuing specialization in Back-end.",
  "education.po.1": "One Education Program",
  "education.po.2": "The program equips students with technical and behavioral skills to act as Jr. Developers, professionals working to create and enhance websites, software, and applications, preparing them for employment opportunities.",
  "education.tu.1": "University Technical Degree",
  "education.tu.2": "University Technical in Industrial Control Systems and Electricity:",
  "education.tu.3": "The knowledge and skills acquired during my training have prepared me to face challenges in the field of",
  "education.tu.4": "and",
  "education.tu.5": "process automation",
  "education.tu.6": "in different areas.",
  "education.cc.1": "Courses and Certifications",
  "education.cc.2": "SEO and Web Positioning for Web Developers",
  "education.cc.3": "English for Developers",
  "job": "Work",
  "job.ds.1": "Software Developer",
  "job.ds.2": "08-2023 to present",
  "job.ds.3": "E-Commerce Project for a horse supplies store.",
  "job.ds.4": "Dental Clinic Project.",
  "job.ds.5": "Event Hall Reservations Project.",
  "job.ds.6": "• In each project, I worked to improve workflow efficiency and team collaboration, implementing agile methodologies.",
  "job.ds.7": "• I participated in both front-end and back-end development, as well as in configuring and managing application infrastructures. Some Technologies I've implemented in my projects are:",
  "job.ds.8": "• Infrastructure:",
  "job.ds.9": "• Agile Methodologies: ",
  "job.dw.1": "Web Developer",
  "job.dw.2": "As a web developer in a dynamic startup, I was involved in developing and implementing sites using",
  "job.me.1": "Metallurgist and Electrician",
  "job.me.2": "Where I learned to",
  "job.me.3": "work in a team",
  "job.me.4": ", as well as to have",
  "job.me.5": ", autonomy ",
  "job.me.6": "being responsible for the electrical area, as well as being part of an organization, meeting deadlines, effectively problem-solving, among other things.",
  "job.me.7": "Both companies provided me with a Letter of Recommendation and allow me to use them as references for future jobs.",
  "skill.front-end.tittle.1": "What programming languages do I use for Front-end?",
  "skill.front-end.1": "I master languages like HTML, CSS, and JavaScript for creating interactive and appealing user interfaces.",
  "skill.front-end.tittle.2": "Frameworks and Libraries",
  "skill.front-end.2": "I have experience in using popular frameworks and libraries like React, Bootstrap, Material UI, Formik, Yup, Axios, and I'm learning Typescript for web development.",
  "skill.front-end.tittle.3": "Responsive Design",
  "skill.front-end.3": "I can create websites that adapt to different screen sizes and devices using CSS and media queries.",
  "skill.front-end.tittle.4": "Front-end Technologies",
  "skill.soft-skill.tittle": "Soft Skills",
  "skill.back-end.tittle.1": "What programming languages do I use for Back-end?",
  "skill.back-end.1": "I primarily use Java and Node.js for Back-end development.",
  "skill.back-end.tittle.2": "Frameworks and libraries I use",
  "skill.back-end.2": "I usually work with Spring Boot and Express.js for Back-end development.",
  "skill.back-end.tittle.3": "Databases and Infrastructure",
  "skill.back-end.3": "I have experience in database design and in using database management systems like MySQL and MongoDB. I also use Terraform to set up infrastructure on AWS.",
  "skill.back-end.tittle.4": "Back-end Technologies",
  "skill.soft-skill.tittle.1": "Communication Skills",
  "skill.soft-skill.1": "I consider myself a person with strong communication skills, capable of explaining technical content to non-technical individuals.",
  "skill.soft-skill.tittle.2": "Teamwork",
  "skill.soft-skill.2": "I have effectively worked as part of various software development teams, meeting deadlines and collaborating proactively with team members.",
  "skill.soft-skill.tittle.3": "Problem Solving",
  "skill.soft-skill.3": "I possess excellent problem-solving skills, providing creative and efficient solutions to various technical challenges.",
  "skill.soft-skill.tittle.4": "Daily Development and Collaboration Tools",
  "contact.1": "Contact ",
  "contact.2": "Looking for a Developer?",
  "contact.3": "I am a Full Stack developer, capable of building custom front-end and back-end solutions, implementing best practices and agile methodologies.",
  "contact.4": "I code to create solutions, not just to solve problems.",
  "proyect.see-more": "See More",
  "proyect.1": "ElHacendado.com is a project designed for a private client in Medellin, Colombia. This comprehensive space focuses on providing high-quality products and services for horse enthusiasts, ensuring transparency and easy access to business owners. Various technologies were employed for this project, some of which are detailed below. In addition to those mentioned in the lower section, notable libraries such as Formik, Yup, and Axios, as well as frameworks like Bootstrap, were utilized. Technologies like Spring Security, API-Rest, Hibernate, and cloud solutions, including Cloudflare, were also used.",
  "proyect.2": "Odontotal.online offers the services of a dental clinic. With Odontotal, users can schedule appointments with various specialists based on their preferred schedule once they have registered on the platform. Additionally, the application includes management functionalities for both an administrator and dentists, who can access the application and use its resources to conduct medical follow-ups on their patients.",
  "proyect.3": "Project created within the framework of Digital House, the final Integrator of the 1st year of the CTD career, which aimed to simplify the process of renting event spaces for users, facilitating client communication with the direct owners of the published locations. We created a product to simplify the event space rental process for users, enhancing client communication with the direct owners of the published locations. Those looking to promote their hall or event space have the option to create new posts, attaching basic and extra services offered by their event, site descriptions, receive virtual reservation payments, and enhance quality through professional images. Finally, for the administrators of the e-commerce website, there's the possibility to manage the application in general, the different types of users on the website, the various publications, or any other type of activity related to the natural e-commerce flow.",
  "proyect.4": "A project carried out in a practice environment to strengthen the fundamentals of HTML, CSS, JavaScript, Github, and agile methodologies. A wine shop aiming to offer its products in a simple yet elegant manner. It features a wine searcher, a shopping cart, and a payment form.",
  "proyect.5": "A Petshop allowing users to purchase pet food online, with a pleasing interface that aims to make the user experience comforting.",
  "proyect.6": "A renowned barbershop in Mendoza, Argentina. They needed a website that was elegant and reflected the values and services they offer. For this project, I primarily used a CMS like WordPress, but also leveraged my knowledge of HTML, CSS, and JavaScript to make relevant modifications.",
  "contact.form.1": "Name",
  "contact.form.2": "Email",
  "contact.form.3": "Your phone number",
  "contact.form.4": "How can I assist you?",
  "e.Tech": "Employed Technologies",
  "footer.p1": "Thank you for visiting my website",
  "footer.p2": "It was made with care and effort. I hope you liked it ❤ :D"
}