{
    "greeting": "Hola 👋🏼, Soy ",
    "occupation": "Desarrollador de Software",
    "h2.1": "Sobre me",
    "h2.2": "Experiencia",
    "h2.3": "Proyectos",
    "h2.4": "Contacta Me",
    "aboutMe": "Mi conexión con la tecnología nació a los 7 años con un Family Game, impulsándome a pedir una computadora antes de mi viaje de egresado. Ingresé al mundo tecnológico a través del sector industrial, aprendiendo algoritmos, C++, y PLC mientras avanzaba en mi formación. Desde entonces, mi enfoque se ha centrado en el código. Como desarrollador junior full stack, fusiono creatividad y habilidades técnicas para abordar proyectos desde perspectivas diversas, aspirando a crear soluciones funcionales y experiencias significativas para los usuarios. Mi viaje en la tecnología sigue evolucionando, emocionado por las oportunidades de crecimiento continuo.",
    "education": "Educación",
    "education.ctd.0": "al presente",
    "education.ctd.1": "Carrera creada por",
    "education.ctd.2": "atravez de",
    "education.ctd.3": ", para formar a perfiles muy completos de desarrolladores, abarcando",
    "education.ctd.4": "Infraestructura",
    "education.ctd.5": ", como tambien abordando las habilidades blandas con talleres de",
    "education.ctd.6": "Comunicación efectiva, Trabajo en equipo y Colaboración",
    "education.ctd.7": ", como asi tambíen mesas de trabajos y trabajos Integradores, entre otras. Debido a esto fue que considere que es era la mejor carrera para mi para llegar a ser Desarrollar software.",
    "education.ctd.8": "1 año terminado- Certificado como ",
    "education.ctd.8.1": "Professional Developer.",
    "education.ctd.9": "2 año - Cursando la especialidad de Back-end.",
    "education.po.1": "Programa One Education",
    "education.po.2": "El programa equipa a los estudiantes con habilidades técnicas y conductuales para actuar como Jr. Developer, un profesional que trabaja para crear y mejorar sitios web, software y aplicaciones, y los prepara para obtener una oportunidad laboral.",
    "education.tu.1": "Tenicatura Universitaria",
    "education.tu.2": "Tecníco Universitario en Sistemas de control Infustrial y Electricidad: ",
    "education.tu.3": "Los conocimientos y habilidades adquiridas durante mi formación me han preparado para enfrentar desafíos en el campo de la ingeniería de",
    "education.tu.4": " y la ",
    "education.tu.5": "automatización ",
    "education.tu.6": "de procesos en diferentes áreas.",
    "education.cc.1": "Cursos y Cerficacciones",
    "education.cc.2": "SEO y Posicionamiento web para Desarrolladores web",
    "education.cc.3": "Ingles para Desarrolladores",
    "job": "Trabajo",
    "job.ds.1": "Desarrollador de Software",
    "job.ds.2": "08-2023 hasta la actualidad",
    "job.ds.3": "Proyecto de Comercio Electrónico para una tienda de suministros para caballos.",
    "job.ds.4": "Proyecto de Clínica Dental.",
    "job.ds.5": "Proyecto de Reservas para Salones de Eventos.",
    "job.ds.6": "• En cada proyecto, trabajé para mejorar la eficiencia del flujo de trabajo y la colaboración entre el equipo, implementando metodologías ágiles.",
    "job.ds.7": "• Participé en el desarrollo tanto del front-end como del back-end, además de la configuración y administración de la infraestructura de las aplicaciones. Algunas Tecnologías que e implementado en mis proyectos son:",
    "job.ds.8": "• Infraestructura",
    "job.ds.9": "• Metodologías",
    "job.dw.1": "Desarrollador Web",
    "job.dw.2": "Como desarrollador web en una startup dinámica, estuve involucrado en el desarrollo e implementación de sitios utilizando",
    "job.me.1": "Metalúrgico y Electricista",
    "job.me.2": "Donde aprendí a",
    "job.me.3": "trabajar en equipo",
    "job.me.4": ", así como a tener",
    "job.me.5": ", autonomía ",
    "job.me.6": "siendo responsable del área de electricidad, además de formar parte de una organización, cumplir con plazos, resolver problemas de manera efectiva, entre otras cosas.",
    "job.me.7": "Ambas empresas me proporcionaron una Carta de Recomendación y me permiten utilizarlas como referencias para trabajos futuros.",
    "skill.front-end.tittle.1": "¿Qué lenguajes de programación utilizo para el Front-end?",
    "skill.front-end.1": "Domino lenguajes como HTML, CSS y JavaScript para la creación de interfaces de usuario interactivas y atractivas.",
    "skill.front-end.tittle.2": "Frameworks y Bibliotecas",
    "skill.front-end.2": "Tengo experiencia en el uso de frameworks y bibliotecas populares como React, Bootstrap, Material UI, Formik, Yup, Axios, aprendiendo Typescript para el desarrollo web.",
    "skill.front-end.tittle.3": "Diseño Responsivo",
    "skill.front-end.3": "Puedo crear sitios web que se adaptan a diferentes tamaños de pantalla y dispositivos, utilizando CSS y media queries.",
    "skill.front-end.tittle.4": "Tecnologías de Front-end",
    "skill.back-end.tittle.1": "¿Qué lenguajes de programación utilizo para el Back-end?",
    "skill.back-end.1": "Primordialmente utilizo Java y Node.js para el desarrollo Back-end.",
    "skill.back-end.tittle.2": "Frameworks y librerías que utilizo",
    "skill.back-end.2": "Suelo trabajar con Spring Boot y Express.js en el desarrollo Back-end.",
    "skill.back-end.tittle.3": "Bases de Datos e Infraestructura",
    "skill.back-end.3": "Tengo experiencia en el diseño de bases de datos y en el uso de sistemas de gestión de bases de datos como MySQL y MongoDB. Ademas utilizo Terraform para montar la infraestructura en AWS.",
    "skill.back-end.tittle.4": "Tecnologías de Back-end",
    "skill.soft-skill.tittle": "Habilidades blandas",
    "skill.soft-skill.tittle.1": "Habilidades de comunicación",
    "skill.soft-skill.1": "Me considero una persona con fuertes habilidades de comunicación, capaz de explicar contenido técnico a personas no técnicas.",
    "skill.soft-skill.tittle.2": "Trabajo en equipo",
    "skill.soft-skill.2": "He trabajado eficazmente como parte de varios equipos de desarrollo de software, cumpliendo con los plazos y colaborando proactivamente con los compañeros de equipo.",
    "skill.soft-skill.tittle.3": "Resolución de problemas",
    "skill.soft-skill.3": "Poseo excelentes habilidades de resolución de problemas, proporcionando soluciones creativas y eficientes a distintos desafíos técnicos.",
    "skill.soft-skill.tittle.4": "Herramientas Diarias de Desarrollo y Colaboración",
    "contact.1": "Contacta ",
    "contact.2": "Buscas un Desarrollador?",
    "contact.3": "Soy un desarrollador Full Stack, capaz de construir soluciones personalizadas de front-end y back-end, implementando buenas prácticas y metodologías ágiles.",
    "contact.4": "Programo para crear soluciones, no solo para resolver problemas.",
    "proyect.1": "ElHacendado.com es un proyecto diseñado para un cliente privado en Medellín, Colombia. Este espacio integral se enfoca en brindar productos y servicios de alta calidad para entusiastas de los caballos, asegurando transparencia y acceso sencillo a los propietarios del negocio. Para la realización de este proyecto se emplearon diversas tecnologías, algunas de las cuales se detallan a continuación. Además de las mencionadas en la sección inferior, se destacan librerías como Formik, Yup y Axios, así como frameworks como Bootstrap. Además, se emplearon tecnologías como Spring Security, API-Rest, Hibernate, y soluciones en la nube, incluyendo Cloudflare.",
    "proyect.2": " Odontotal.online ofrece los servicios de una clínica odontológica. Con Odontotal, los usuarios pueden agendar citas con diversos especialistas, según su horario de preferencia, una vez que se han registrado en la plataforma. Además, la aplicación cuenta con funcionalidades de gestión tanto para un administrador como para los odontólogos, quienes pueden acceder a la aplicación y utilizar sus recursos para llevar a cabo un seguimiento médico de sus pacientes.",
    "proyect.3": "Proyecto creado en el marco de Digital House, el final Integrador del 1 año de la carrera de CTD, el cual buscaba simplificar el proceso de alquiler de lugares para eventos al usuario, facilitando la comunicación de los clientes con los propietarios directos de los lugares publicados. Creamos un producto con el fin de simplificar el proceso de alquiler de lugares para eventos al usuario, facilitando la comunicación de los clientes con los propietarios directos de los lugares publicados. Para quienes quieran promocionar su salón y espacio para eventos, tienen la posibilidad de crear nuevas publicaciones adjuntando servicios básicos y extras que ofrece su evento, descripción del sitio, recibir pago de reservaciones de manera virtual y aumentar la calidad a través de imágenes profesionales. Finalmente, para los administradores del sitio web de comercio electrónico, existe la posibilidad de gestionar la aplicación de forma general, los diferentes tipos de usuarios que componen la web, como las diferentes publicaciones o cualquier otro tipo de actividad sobre el flujo natural. del comercio electrónico.",
    "proyect.4": "Un proyecto realizado en un entorno de práctica para afianzar los fundamentos de HTML, CSS, JavaScript, Github y metodologías ágiles. Una vinatería que busca ofrecer sus productos de manera simple pero elegante. Cuenta con un buscador de vinos, carrito de compra y un formulario de pagos.",
    "proyect.5": "Una Petshop que permite al usuario poder comprar el alimento a sus mascotas de manera online, con una interfaz agradable, que trata de hacer la experiencia del usuario reconfortante.",
    "proyect.6": "Una Barberia reconocida en Mendoza, Argentina. La cual necesitaba contar con una pagina a la altura, que fuera elegante y reflejara los valores y los servicios que esta ofrece. Para este proyecto use principalmente un cms como Wordpress, pero tambien me ayude de mis conocimientos en HTML, CSS y Javascript para realizar modificiaciones pertinentes.",
    "contact.form.1": "Nombre",
    "contact.form.2": "Email",
    "contact.form.3": "Tu numero de telefono",
    "contact.form.4": "¿Como puedo ayudarte?",
    "e.Tech": "Tecnologías empleadas",
    "footer.p1": "Gracias por visitar mi sitio web",
    "footer.p2": "Fue hecho con cariño y esfuerzo, espero que te haya gustado ❤ :D"
}