{
  "greeting": "Olá 👋🏼, Sou",
  "occupation": "Desenvolvedor de Software",
  "h2.1": "Sobre mim",
  "h2.2": "Experiência",
  "h2.3": "Projetos",
  "h2.4": "Contate-me",
  "aboutMe": "Minha conexão com a tecnologia começou aos 7 anos com um Family Game, me levando a pedir um computador no lugar de participar de uma viagem de formatura. Adentrei no mundo da tecnologia através do setor industrial, aprendendo algoritmos, C++ e PLC enquanto buscava minha formação. Desde então, meu foco tem girado em torno da codificação. Como desenvolvedor júnior full stack, uno criatividade a habilidades técnicas para abordar projetos de perspectivas diversas, visando criar soluções funcionais e experiências significativas para os usuários. Minha jornada na tecnologia continua a evoluir, e estou entusiasmado com as oportunidades de crescimento contínuo.",
  "education": "Educação",
  "education.ctd.0": "em andamento",
  "education.ctd.1": "Curso criado por",
  "education.ctd.2": "por meio de",
  "education.ctd.3": ", para formar perfis de desenvolvedores altamente versáteis, abrangendo",
  "education.ctd.4": "Infraestrutura",
  "education.ctd.5": ", além de abordar habilidades interpessoais por meio de oficinas sobre",
  "education.ctd.6": "Comunicação Efetiva, Trabalho em Equipe e Colaboração",
  "education.ctd.7": ", juntamente com trabalhos em grupo e projetos integrativos, entre outros. Por isso, considerei esse o melhor caminho para me tornar um Desenvolvedor de Software.",
  "education.ctd.8": "1 ano concluído - Certificado como",
  "education.ctd.8.1": "Desenvolvedor Profissional.",
  "education.ctd.9": "2º ano - Buscando especialização em Back-end.",
  "education.po.1": "Programa One Education",
  "education.po.2": "O programa capacita os estudantes com habilidades técnicas e comportamentais para atuar como Jr. Developers, profissionais que trabalham para criar e aprimorar sites, software e aplicativos, preparando-os para oportunidades de emprego.",
  "education.tu.1": "Grau Técnico Universitário",
  "education.tu.2": "Técnico Universitário em Sistemas de Controle Industrial e Eletricidade:",
  "education.tu.3": "Os conhecimentos e habilidades adquiridos durante minha formação me prepararam para enfrentar desafios no campo de",
  "education.tu.4": "e",
  "education.tu.5": "automação de processos ",
  "education.tu.6": "em diferentes áreas.",
  "education.cc.1": "Cursos e Certificações",
  "education.cc.2": "SEO e Posicionamento na Web para Desenvolvedores Web",
  "education.cc.3": "Inglês para Desenvolvedores",
  "job": "Trabalho",
  "job.ds.1": "Desenvolvedor de Software",
  "job.ds.2": "08-2023 até o presente",
  "job.ds.3": "Projeto de Comércio Eletrônico para uma loja de suprimentos para cavalos.",
  "job.ds.4": "Projeto de Clínica Odontológica.",
  "job.ds.5": "Projeto de Reservas para Salões de Eventos.",
  "job.ds.6": "• Em cada projeto, trabalhei para melhorar a eficiência do fluxo de trabalho e a colaboração entre a equipe, implementando metodologias ágeis.",
  "job.ds.7": "• Participei tanto do desenvolvimento de front-end quanto de back-end, além da configuração e gerenciamento da infraestrutura das aplicações. Algumas tecnologias que implementei em meus projetos são:",
  "job.ds.8": "• Infraestrutura:",
  "job.ds.9": "• Metodologias ágeis",
  "job.dw.1": "Desenvolvedor Web",
  "job.dw.2": "Como desenvolvedor web em uma startup dinâmica, estive envolvido no desenvolvimento e implementação de sites utilizando",
  "job.me.1": "Metalúrgico e Eletricista",
  "job.me.2": "Onde aprendi a",
  "job.me.3": "trabalhar em equipe",
  "job.me.4": ", bem como a ter",
  "job.me.5": ", autonomia",
  "job.me.6": "sendo responsável pela área de eletricidade, além de fazer parte de uma organização, cumprir prazos, resolver problemas de forma eficaz, entre outras coisas.",
  "job.me.7": "Ambas as empresas me forneceram uma Carta de Recomendação e me permitem usá-las como referências para futuros trabalhos.",
  "skill.front-end.tittle.1": "Quais linguagens de programação eu uso para o Front-end?",
  "skill.front-end.1": "Domino linguagens como HTML, CSS e JavaScript para a criação de interfaces de usuário interativas e atraentes.",
  "skill.front-end.tittle.2": "Frameworks e Bibliotecas",
  "skill.front-end.2": "Tenho experiência no uso de frameworks e bibliotecas populares como React, Bootstrap, Material UI, Formik, Yup, Axios, e estou aprendendo TypeScript para desenvolvimento web.",
  "skill.front-end.tittle.3": "Design Responsivo",
  "skill.front-end.3": "Posso criar websites que se adaptam a diferentes tamanhos de tela e dispositivos, usando CSS e media queries.",
  "skill.front-end.tittle.4": "Tecnologias de Back-end",
  "skill.back-end.tittle.1": "Quais linguagens de programação eu uso para o Back-end?",
  "skill.back-end.1": "Principalmente utilizo Java e Node.js para o desenvolvimento Back-end.",
  "skill.back-end.tittle.2": "Frameworks e Bibliotecas que eu uso",
  "skill.back-end.title.2": "Normalmente trabalho com Spring Boot e Express.js no desenvolvimento Back-end.",
  "skill.back-end.tittle.3": "Bancos de Dados e Infraestrutura",
  "skill.back-end.3": "Tenho experiência no design de bancos de dados e no uso de sistemas de gerenciamento de bancos de dados como MySQL e MongoDB. Além disso, uso Terraform para montar a infraestrutura na AWS.",
  "skill.back-end.tittle.4": "Tecnologias de Back-end",
  "skill.soft-skill.tittle": "Habilidades interpessoais",
  "skill.soft-skill.tittle.1": "Habilidades de Comunicação",
  "skill.soft-skill.1": "Me considero uma pessoa com fortes habilidades de comunicação, capaz de explicar conteúdo técnico para pessoas não técnicas.",
  "skill.soft-skill.tittle.2": "Trabalho em Equipe",
  "skill.soft-skill.2": "Trabalhei eficazmente como parte de várias equipes de desenvolvimento de software, cumprindo prazos e colaborando proativamente com os colegas de equipe.",
  "skill.soft-skill.tittle.3": "Resolução de Problemas",
  "skill.soft-skill.3": "Possuo excelentes habilidades de resolução de problemas, fornecendo soluções criativas e eficientes para diversos desafios técnicos.",
  "skill.soft-skill.tittle.4": "Ferramentas diárias de desenvolvimento e colaboração",
  "proyect.see-more": "Ver Mais",
  "proyect.1": "ElHacendado.com é um projeto projetado para um cliente privado em Medellín, Colômbia. Este espaço abrangente concentra-se em fornecer produtos e serviços de alta qualidade para entusiastas de cavalos, garantindo transparência e fácil acesso aos proprietários de negócios. Foram empregadas diversas tecnologias para este projeto, algumas das quais estão detalhadas abaixo. Além das mencionadas na seção inferior, bibliotecas notáveis como Formik, Yup e Axios, bem como frameworks como Bootstrap, foram utilizados. Tecnologias como Spring Security, API-Rest, Hibernate e soluções em nuvem, incluindo Cloudflare, também foram empregadas.",
  "proyect.2": "Odontotal.online oferece os serviços de uma clínica odontológica. Com a Odontotal, os usuários podem agendar consultas com vários especialistas com base em seu cronograma preferido, uma vez que se registraram na plataforma. Além disso, o aplicativo inclui funcionalidades de gestão tanto para um administrador quanto para dentistas, que podem acessar o aplicativo e utilizar seus recursos para realizar acompanhamentos médicos em seus pacientes.",
  "proyect.3": "Projeto criado no âmbito da Digital House, o Integrador final do 1º ano da carreira CTD, que visava simplificar o processo de aluguel de espaços para eventos para os usuários, facilitando a comunicação dos clientes com os proprietários diretos dos locais publicados. Criamos um produto para simplificar o processo de aluguel de espaços para eventos para os usuários, aprimorando a comunicação com os proprietários diretos dos locais publicados. Aqueles que desejam promover seu salão ou espaço para eventos têm a opção de criar novas postagens, anexando serviços básicos e extras oferecidos por seu evento, descrições do local, receber pagamentos de reservas virtuais e aprimorar a qualidade por meio de imagens profissionais. Por fim, para os administradores do site de comércio eletrônico, há a possibilidade de gerenciar o aplicativo de forma geral, os diferentes tipos de usuários no site, as várias publicações ou qualquer outro tipo de atividade relacionada ao fluxo natural do comércio eletrônico.",
  "proyect.4": "Um projeto realizado em um ambiente de prática para fortalecer os fundamentos de HTML, CSS, JavaScript, Github e metodologias ágeis. Uma loja de vinhos que busca oferecer seus produtos de maneira simples, mas elegante. Possui um buscador de vinhos, um carrinho de compras e um formulário de pagamento.",
  "proyect.5": "Um Petshop que permite aos usuários comprar comida para animais de estimação online, com uma interface agradável que visa tornar a experiência do usuário reconfortante.",
  "proyect.6": "Uma barbearia reconhecida em Mendoza, Argentina. Eles precisavam de um site que fosse elegante e refletisse os valores e os serviços que oferecem. Para este projeto, usei principalmente um CMS como o WordPress, mas também aproveitei meus conhecimentos em HTML, CSS e JavaScript para fazer modificações relevantes.",
  "contact.1": "Contate-",
  "contact.2": "Procurando um Desenvolvedor?",
  "contact.3": "Sou um desenvolvedor Full Stack, capaz de construir soluções personalizadas de front-end e back-end, implementando as melhores práticas e metodologias ágeis.",
  "contact.4": "Eu programo para criar soluções, não apenas para resolver problemas.",
  "contact.form.1": "Nome",
  "contact.form.2": "E-mail",
  "contact.form.3": "Seu número de telefone",
  "contact.form.4": "Como posso ajudar você?",
  "e.Tech": "Tecnologia usada",
  "footer.p1": "Obrigado por visitar o meu site",
  "footer.p2": "Foi feito com carinho e esforço. Espero que você tenha gostado ❤ :D"
}